import React from "react";
import './About.css'; // אל תשכחי להוסיף את קובץ ה-CSS

export default function About() {
    return (
        <div className="about-container">
            <h1 className="about-header">קצת עלי...</h1>
            <p className="about-text">
                שלום וברוכות הבאות לאתר שלי! אני נטלי, אוהבת בישול, יצירתיות ושיתוף מתכונים עם אחרים. מאז שאני זוכרת את עצמי, המטבח היה המקום שבו הרגשתי הכי בבית. התחלתי ללמוד לבשל בגיל צעיר, ובמהלך השנים המשכתי לפתח את הידע והכישורים שלי. כל מתכון שאני יוצרת מגיע מתוך תשוקה אמיתית למזון טוב, שמחבר אנשים ומביא שמחה לכל שולחן.
            </p>
            <p className="about-text">
                הבישול עבורי הוא לא רק מקצוע – הוא דרך חיים. למדתי את רזי הבישול דרך שנים של ניסיון, ניסוי וטעייה, וגם דרך קורסים מקצועיים שבהם העמקתי את הידע שלי. במהלך השנים, פיתחתי סגנון אישי משלי, שמורכב ממסורת וגם חדשנות, חומרים טריים ותחושת יצירתיות שאין לה תחליף.
            </p>
            <p className="about-text">
                האתר הזה נולד מתוך רצון לשתף את הידע שצברתי וליצור מקום שכולו מוקדש לאנשים שמחפשים השראה במטבח. כל מתכון באתר עבר הרבה מאוד תהליכי פיתוח ושיפור, ואני תמיד שואפת להביא לכם את המתכונים הכי טעימים, בריאים ומעוררי השראה. אני מאמינה שכל אחת יכולה להכין אוכל טעים ויפה, גם אם היא לא שף מקצועית.
            </p>
            <p className="about-text">
                אני גם עוסקת בכתיבת ספרי בישול, בהם אני משתפת מתכונים ייחודיים וטכניקות בישול שאני אוהבת. ספרי נכתבים מתוך ניסיון אישי וביקורות מקהל הקוראים שלי, ואני גאה לראות איך הם מקבלים מקום חם בלבבות ובמטבחים של הרבה אנשים. כל ספר שאני כותבת הוא פרי עבודה רבה ותשוקה אמיתית למזון טוב.
            </p>
            <p className="about-text">
                אני מזמינה אתכם להיכנס לעולם שלי, לנסות את המתכונים ולגלות את השמחה שבבישול. אין דבר שמשמח אותי יותר מלראות אנשים מכינים את המתכונים שלי, וכל תגובה או שאלה מכם רק מעודדת אותי להמשיך וליצור.
            </p>
            <p className="about-text">
                תודה רבה שבחרתן לבקר באתר שלי. אני מקווה שתמצאו כאן השראה שתשפר את חווית הבישול שלכן ותביא למטבח שלכן הרבה רגעים טעימים.
            </p>
            <p className="about-signature">באהבה, <br />נטלי</p>

            <h2 className="books-title">הספרים שלי</h2>
            <div className="books-images">
                <img src={process.env.PUBLIC_URL + "img/813EPjx3kWL.jpg"} alt="ספר 1" className="book-image" />
                <img src={process.env.PUBLIC_URL + "img/img1.jpg"} alt="ספר 2" className="book-image" />
                <img src={process.env.PUBLIC_URL + "img/img2.jpg" } alt="ספר 3" className="book-image" />
                <img src={process.env.PUBLIC_URL + "img/img3.jpg"} alt="ספר 4" className="book-image" />
            </div>
            <h5>*הספרים זמינים בחנות ספירם ובישול </h5>
        </div>
    )
}
